#!/usr/bin/env python
# coding: utf-8

# In[1]:


row = "Lambdadambda"
#Вывести третий символ этой строки.
print(row[2])
#Вывести предпоследний символ этой строки.
print(row[-2])
#Вывести первые пять символов этой строки.
print(row[:5])
#Вывести строку, кроме последних двух символов.
print(row[:-2])
#Вывести все символы с четными индексами (считайте, что 0 - четный индекс).
print(row[::2])
#Вывести все символы с нечетными индексами.
print(row[1::2])
#Вывести все символы в обратном порядке.
print(row[::-1])
#Вывести все символы строки через один в обратном порядке, начиная с последнего.
print(row[::-2])
#Вывести длину данной строки.
print(len(row))

